fn main() {
    let r;                                    //----------+--- 'a
    {                                               //          |            
        let x = 5;                             //---+-- 'b |
        r = &x;                                     //   |      |
        println!("r: {}", r);                       //---+-- 'b |
    }                                               //          |
    println!("r: {}", r);   // Compiling error      //----------+--- 'a
    //被引用者(x)死亡后引用者(r)还活着，引用就会变成非法，非法的引用不可使用

    let x = 5;                                 //----------+--- 'b
                                                    //          |
    let r = &x;                               //---+-- 'a |
                                                    //   |      |
    println!("r: {}", r);                           //---+------+--- 'b
    //  被引用者不比引用者先死，则引用是安全的         //   'a
}                                                   
